
// let f = v => v // es6新增定义函数方式

//函数表达式
// function fn (a) {

// 	return a;
// }
// console.log(fn(1));

//--------------------------华丽分割线---------------------------------

//es新增

// fn = a => a;

// console.log(fn(1));//1

//--------------------------华丽分割线---------------------------------

// function bar () {
// 	for (var i = 0; i < 10; i++) {

// 	}
// }

//--------------------------华丽分割线---------------------------------

// bar = () => {
// 	for (var i = 0; i < 10; i++) {
// 		console.log(i)
// 	}
// }

// bar();//0123456789

//--------------------------华丽分割线---------------------------------

let nums = Array.of( 1, 2, 4, 16 );

	// nums.find(function (val, key, arr) {

	// })

let res = nums.find( (val, key, arr) => {
	return val ==2;
});

console.log(res);